KuprinIV/STM32F405-TLV320AIC3204/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
typedef struct
{
	uint8_t isDelayMeasureTestEnabled;
	uint16_t delayBetweenStimAndResponse;
	uint8_t isScanningTimerUpdated;
	uint8_t LED_state; // LED state: 0 - off, 1 - on, 2 - blinking 1 Hz, 3 - blinking 5 Hz
	void (*StartDelayMeasureTimer)(void);
	// BT firmware update
	uint8_t isBtFwUpdateStarted;
	uint8_t isBtReadyToReceiveNextPacket;
	uint8_t startBTBootMode;
	uint8_t stopBTBootMode;
	uint8_t* btFwPacket64b;
}KeyboardState;
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */
extern KeyboardState *kbState;
/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define USER_BUTTON_Pin GPIO_PIN_13
#define USER_BUTTON_GPIO_Port GPIOC
#define BT_LINK_Pin GPIO_PIN_1
#define BT_LINK_GPIO_Port GPIOC
#define BT_RST_Pin GPIO_PIN_2
#define BT_RST_GPIO_Port GPIOC
#define BT_BOOT_Pin GPIO_PIN_3
#define BT_BOOT_GPIO_Port GPIOC
#define SPI1_SS_Pin GPIO_PIN_4
#define SPI1_SS_GPIO_Port GPIOA
#define CODEC_RST_Pin GPIO_PIN_7
#define CODEC_RST_GPIO_Port GPIOC
#define LED_Pin GPIO_PIN_10
#define LED_GPIO_Port GPIOC
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
